-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: buyreadreview
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `author`
--

LOCK TABLES `author` WRITE;
/*!40000 ALTER TABLE `author` DISABLE KEYS */;
INSERT INTO `author` VALUES (1,'Іван','Багряний',NULL),(2,'Іван ','Франко',NULL),(3,'Діна','Бухольц',NULL),(4,'Анатолій','Дімаров',NULL),(5,'Микола','Хвильовий',NULL),(6,'Василь','Крас',NULL),(7,'Ольга','Саліпа',NULL),(8,'Кузьма','Скрябін',NULL),(9,'Євген','Шишащьцикй',NULL),(10,'Ольга','Кобилянська',NULL),(11,'Пантелеймон','Куліш',NULL),(13,'Іван','Котляревський',NULL),(14,'Григорій','Сковорода',NULL),(15,'Микола','Гоголь',NULL),(16,'Михайло','Коцюбинський',NULL),(17,'Володимир','Винниченко',NULL),(18,'Дара','Корній',NULL);
/*!40000 ALTER TABLE `author` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `author_book`
--

LOCK TABLES `author_book` WRITE;
/*!40000 ALTER TABLE `author_book` DISABLE KEYS */;
INSERT INTO `author_book` VALUES (1,1),(13,1),(2,2),(3,3),(4,4),(5,5),(6,6),(7,7),(8,8),(9,8),(10,9),(11,10),(12,11),(14,13),(15,14),(16,16),(17,16),(18,16),(19,16),(20,17),(21,17),(22,17),(23,17),(24,18),(25,18),(26,18),(27,18),(28,18);
/*!40000 ALTER TABLE `author_book` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book`
--

LOCK TABLES `book` WRITE;
/*!40000 ALTER TABLE `book` DISABLE KEYS */;
INSERT INTO `book` VALUES (304,'Тигролови','Іван Багряний (1906—1963; справжнє прізвище — Лозов’ягін) — український письменник, який зазнав жорстокості сталінських репресій. Митця було ув’язнено, заслано до Далекого Сходу, потім була еміграція. Лише після своєї смерті він був реабілітований, став лауреатом Шевченківської премії 1992 року, і його книги почали перевидавати в Україні. Герой роману «Тигролови», молодий український інженер-авіатор Григорій Многогрішний, катований, голодний, засуджений на 25 років ув’язнення, втік по дорозі до концтабору прямо посеред суворої сибірської тайги. Майор НКВС Медвин — «професійний тигролов» — розпочинає полювання на втікача…','978-966-03-9620-3',0,195.00000000,20,'UKR000000000104582',1,1),(248,'Захар Беркут: образ громадського життя Карпатської Русі в XIII віці: історична повість','«Захар Беркут» — найвідоміший твір І. Франка на історичну тему про боротьбу давніх карпатських общин проти нашестя монголів та соціального гноблення. Повість було написано на конкурс, оголошений журналом «Зоря», та вперше видано 1883 р. в цьому ж журналі. На основі повісті знято однойменний фільм.','978-966-10-4756-2',0,129.00000000,10,'UKR000000000012101',2,2),(240,'Неофіційна кулінарна книга Гаррі Поттера','Прихильники книг про Гаррі Поттера тепер зможуть потрапити у казковий світ, де живуть маги й чарівники. Для цього потрібно докласти трошечки зусиль, використати дещицю продуктів і обрати рецепт із «Неофіційної кулінарної книги Гаррі Поттера». Смакуючи гарбузовим печивом, пончиками з джемом, солодкою помадкою або чимось іншим, ви зможете на деякий час стати одним із героїв захопливих історій про хлопчика-чарівника. Подарункове видання, оформлене під старовину,  містить докладні рецепти, зібрані в десяти розділах. Завдяки точним інструкціям ви легко зможете приготувати будь-яку страву.','978-617-548-061-8',0,600.00000000,4,'UKR000000000104734',3,5),(976,'І будуть люди','Пророчі слова великого Тараса, що «на оновленій землі врага не буде, супостата, а буде син, і буде мати, і будуть люди на землі» стали непохитним переконанням і Анатолія Дімарова: останній рядок цього твердження він узяв за назву одного з кращих своїх творінь. Хоч у ньому йдеться про найтрагічніші сторінки життя українського селянства періоду колективізації-Голодомору, хоч до нашої Незалежності ще залишалися довгі десятиліття. Річ у тім, що беручись за написання  роману, а це початок 1960-х, письменник уже позбувся облуди радянщини. Зате вона цупко трималася за свої наративи — третину твору цензура скоротила. Нині ця правдива історія започаткувала нову сторінку у своєму життєписі: видавництво «Фоліо» перевидає її без купюр, а недавня 12-серійна екранізація роману здобула визнання як перша в країні історична родинна сага.','978-966-03-9593-0',0,720.00000000,9,'UKR000000000027412',4,1),(384,'Я (Романтика)','До видання увійшли вибрані твори українського прозаїка, поета, публіциста, одного з основоположників пореволюційної прози Миколи Хвильового (1893–1933), справжнє ім’я якого — Микола Фітільов. Письменник показав вадикомуністичного суспільства, правдиво зобразив «юних фанатиків комуни», «вірних псів революції», «липових комуністів».','978-966-10-5989-3',0,249.00000000,5,'UKR000000000105894',5,2),(608,'Руїна','«Руїна» розповідає про події 1658 року. Громадянська війна в Україні, початок Руїни. Головні герої роману, побратими українець Максим Перепечай та поляк Янек Сулковський, проходять нелегкий, сповнений пригод шлях , який приводить одного до Блискучої Порти, а згодом — і до чорноморських піратів, а другого у стан болгарських гайдуків , перш, ніж вони знову зустрінуться у горах Старої Планини. Запорожець Тарас Завірюха зі побратимами-козаками очолює курінь особистої охорони гетьмана Івана Виговського. Їм протистоять агенти Таємного приказу і зрадники-лиходії, які допомагають Пушкарю і намагаються зірвати домовленості між Гетьманатом і Річчю Посполитою.','978-966-03-9381-3',0,195.00000000,30,'UKR000000000027237',6,1),(224,'Оля','Поки одні співчувають її самотності, інші на пальцях перераховують її чоловіків… З дитинства Ольга розуміє, що вона «не така». Її сила лякає і притягує, її почуття і пристрасть горять вогнем. Але вона сама — згоряє чи гартується? Ось він, ідеал: розумний, інтелігентний Маковей. Негідник чи рятівник? Злочинець чи жертва? Чи витримає кохання сильної жінки? Бо ж власні «скелети в шафі» не дають про себе забути. На шляху їхнього спільного щастя багато тіней з минулого. Кобилянська. Про неї знають все, але її не знає ніхто. Щоденники, листи, твори... Найбільша містифікація української літератури, створена нею самою. Роман «Оля», володар Гран-прі «Коронації слова-2020», не про письменницю, а про жінку. Пристрасну, вперту, але з власними комплексами та помилками, живу... Це дебютний роман Ольги Саліпи, що відома як поетка і авторка малої прози.','978-966-03-9413-1',0,190.00000000,10,'UKR000000000026233',7,1),(160,'Я, \"Побєда\" і Берлін','Ця книжка — літературний дебют відомого українського співака Андрія Кузьменка (Кузьми), лідера групи «Скрябін», який загинув в автомобільній аварії 2 лютого 2015 року. До збірки увійшли дві повісті, а також тексти відомих пісень групи. Перша повість — «Я, “Побєда” і Берлін» — проникнута яскравим почуттям гумору, веселим настроєм і, напевне, розсмішить навіть дуже серйозних читачів. Події відбуваються навколо старого і пошарпаного автомобіля марки «Побєда», на якому Андрій зі своїм другом Бардом подорожують до столиці Німеччини. Друга повість — «Місто, в якому не ходять гроші» — зовсім інша за жанром. Це невесела історія про дівчину Алісу, яка через збіг обставин опинилася в жахливому місті, де панують людиноненависництво, нечувана жорстокість і нелюдські порядки, — місті, з якого немає дороги назад…','978-617-551-030-8',0,145.00000000,14,'UKR000000000104738',8,1),(224,'Я, Паштєт і Армія','Кузьма Скрябін (справжнє ім\'я Андрій Кузьменко) народився в місті Самбір Львівської області 17 серпня 1968 року. Закінчив музичну школу за класом фортепіано. У 1989 році записав першу пісню у складі музичної групи \"Скрябін\". З того часу став відомим як співак, автор музики і текстів багатьох десятків пісень, а також ще й як талановитий письменник. 2 лютого 2015 року Кузьма Скрябін загинув в автомобільній катастрофі. Ця книжка - виключно чоловіча п\'єса з використанням характерної військової риторики, написана відомим українським співаком Андрієм Кузьменком (Кузьмою), лідером групи \"Скрябін\". Книга \"Я, Паштєт і Армія\" - розповідь про армійського друга Кузьми Паштєта (Сергія Павлова), який потрапив в армію через проблеми з деканом в університеті, де Сергій був кандидатом біологічних наук. Книга проникнута армійськими буднями та гумором, який підійме настрій кожному.','978-966-03-7199-6',0,140.00000000,7,'UKR000000000004593',9,1),(224,'Мандрівка до потойбіччя. Маріуполь','Євген Шишацький — редактор, журналіст. Народився і виріс у місті Маріуполь. З 2014 року живе й працює в Києві. Як і в кожного українця, 24 лютого 2022 року світ Євгена перевернувся. У Маріуполі під обстрілами були мама і друзі, з якими обірвався зв’язок. Євген приймає рішення їхати на окупований Схід, щоб допомогти евакуювати людей. «Мандрівка до потойбіччя. Маріуполь» — сповідь водія-волонтера, що дивом вибрався з-під Маріуполя. Автор описує реальну історію про подорож до «краю застиглого часу», розповідає про людей, яких життєвий вибір і доля занесли саме сюди, про свій вибір, «от такий, недодуманий, але свідомий. У пошуках своїх. У пошуках себе. З фаталістичною готовністю до нового досвіду».','978-617-551-117-6',0,190.00000000,3,'UKR000000000104744',10,1),(352,'Земля','Ольга Кобилянська (1863—1942) — видатна письменниця-демократка, класик української літератури. Її творча спадщина велика й різноманітна. Повість «Земля» — вершина реалізму письменниці. Цей твір, завдяки своїй великій життєвій правді й високій художності, став одним з найвідоміших в українській літературі. Усім своїм єством пов’язаний із землею герой повісті Івоніка Федорчук. Він шанує й береже землю, тяжко працює на ній усе своє життя, плекаючи надію, що вона принесе щастя його синам. Але боротьба за землю, яка роками точилася в його родині, зруйнувала душі рідних людей, призвела до трагедії, до братовбивства. Із втратою сина втрачає Івоніка свої мрії та сподівання, свою віру в землю.','978-966-03-9506-0',0,245.00000000,2,'UKR000000000100036',11,1),(192,'Чорна рада. Хроніка 1663 року','Пантелеймон Куліш (1819-1897) — визначний український письменник, просвітитель і гуманіст, один із фундаторів української національної свідомості і нової літератури. Письменницький талант Куліша виявився у різних художніх жанрах: він писав прозу, вірші, поеми, драми, багато перекладав. В історію української літератури увійшов насамперед як автор першого історичного роману «Чорна рада. Хроніка 1663 року», в якому відтворив події 1663 року, коли після смерті Богдана Хмельницького почалася запекла боротьба за гетьманську булаву.','978-966-03-9899-3',0,165.00000000,7,'UKR000000000105528',12,1),(304,'Тигролови','Іван Багряний (1906—1963; справжнє прізвище — Лозов’ягін) — український письменник, який зазнав жорстокості сталінських репресій. Митця було ув’язнено, заслано до Далекого Сходу, потім була еміграція. Лише після своєї смерті він був реабілітований, став лауреатом Шевченківської премії 1992 року, і його книги почали перевидавати в Україні. Герой роману «Тигролови», молодий український інженер-авіатор Григорій Многогрішний, катований, голодний, засуджений на 25 років ув’язнення, втік по дорозі до концтабору прямо посеред суворої сибірської тайги. Майор НКВС Медвин — «професійний тигролов» — розпочинає полювання на втікача…','978-617-551-212-8',0,260.00000000,13,'UKR000000000105855',13,1),(352,'Енеїда','Ім’я Івана Петровича Котляревського (1769-1838), засновника нової української літератури, пов’язують, у першу чергу, з його поемою «Енеїда» (1798), яка вже понад двісті років зачаровує читачів. Це була перша друкована українська книга, написана народною мовою, перша національна поема. Запозичивши сюжет античної поеми Вергілія, Котляревський наповнив цей твір дотепним українським гумором, повір’ями, звичаями, картинами воєнного і мирного життя, описом одягу, страв — усе це надає поемі яскравого національного колориту. «Енеїду» сміливо можна назвати своєрідною енциклопедією українського побуту кінця XVIII — початку XIX століття.','978-617-551-040-7',0,230.00000000,30,'UKR000000000105856',14,1),(352,'Літературні твори','Унікальність видання в тому, що тут чи не вперше зібрано в одній книзі художні твори видатного філософа в повному їхньому обсязі з додачею вибраних упорядником з різних текстів (і художніх, і філософських) афоризмів, які сягають вершин афористики. Книга містить ґрунтовну розвідку В. Шевчука про письменницьку спадщину Г. Сковороди та біографію, написану учнем філософа М. Ковалинським. Всі тексти подаємо в перекладі сучасною літературною мовою. Система ілюстрацій відбиває образотворче бачення світу XVIII століття.','978-617-629-723-9',0,380.00000000,6,'UKR000000000102104',15,3),(244,'Тіні забутих предків','До збірки увійшли сім творів класика української літератури, неперевершеного майстра слова Михайла Коцюбинського: \"Хо\", \"Дорогою ціною\", \"Відьма\", \"Тіні забутих предків\", \"Нюренберзьке яйце\", \"Для загального добра\", \"Коні не винні\". Невеличкі за обсягом оповіді відтворюють поетичний світ давніх гуцульських традицій, колоритно описують надзвичайну природу Карпат, міфологічне світосприйняття українського народу та органічну єдність з природою. Нікого не залишать байдужим яскраві образи, захопливі сюжети та сильні і нестримні почуття, які створюють особливе емоційне напруження, що надовго залишає вийнятковий післясмак.','978-617-629-504-4',0,180.00000000,1,'UKR000000000103077',16,3),(96,'Тіні забутих предків. Intermezzo','До видання увійшли одні з найкращих творів талановитого українського письменника, чудового новеліста, послідовника І. Франка, майстра слова Михайла Коцюбинського — повість «Тіні забутих предків» та новела «Intermezzo». Невеликі за обсягом, проте психологічно напружені твори, в яких письменник зобразив живі й правдиві образи, належать до найвищих досягнень української класичної прози.','978-966-10-5116-3',0,79.00000000,8,'UKR000000000022319',17,2),(96,'Тіні забутих предків. Intermezzo','До видання увійшли одні з найкращих творів талановитого українського письменника, чудового новеліста, послідовника І. Франка, майстра слова Михайла Коцюбинського — повість «Тіні забутих предків» та новела «Intermezzo». Невеликі за обсягом, проте психологічно напружені твори, в яких письменник зобразив живі й правдиві образи, належать до найвищих досягнень української класичної прози.','978-966-10-5123-1',0,119.00000000,16,'UKR000000000022314',18,2),(336,'Тіні забутих предків','Михайло Коцюбинський — самобутній письменник, що збагатив світову літературу проникливими творами. Він відкрив у вітчизняній літературі сторінку модерну та імпресіонізму. Ця книга, одна з найкращих в усій українській літературі, розповідає про кохання гуцульських Ромео та Джульєтти і приголомшує драматизмом подій та доль.','978-617-12-6303-1',0,200.00000000,3,'UKR000000000021981',19,4),(96,'Федько-халамидник. Оповідання','Збірка містить оповідання «Федько-халамидник», «Кумедія з Костем», «Салдатики!» та «Момент». Твори Володимира Винниченка сповнені драматизму. Автор правдиво зображає трагічні людські долі, детально змальовує психологію дітей і дорослих, майстерно показує тонку межу між щастям та горем. Ці оповідання — взірці української малої прози першої половини ХХ століття, що досі зворушують серця читачів і читачок.','978-617-548-088-5',0,90.00000000,23,'UKR000000000104373',20,5),(640,'Щось більше за нас','Український державний діяч, прозаїк, драматург і художник Володимир Винниченко (1880–1951) дебютував у літературі на початку ХХ ст. Був змушений покинути Україну, якийсь час проживав у Австрії, Німеччині, Швейцарії, Італії, Франції. За кордоном співпрацював із низкою українських видань, політична кар\'єра митця тривала і в еміграції. Сюжети новел та оповідань, що увійшли до видання, здебільшого відбивають соціальні струси початку ХХ ст. Наростання невдоволення селян, які готові піти проти пана, змальовується в оповіданні «Суд». У творі «Салдатики!» розкрита психологія лідерства — з непримітного селянина народжується ватажок. Невідповідність між оболонкою і суттю робить кумедним в очах оточення героя твору «Народний діяч». У оповіданнях «Біля машини», «На пристані», «Раб краси» відображена вперше в українській літературі революційна інтелігенція.','978-966-03-8416-3',0,294.00000000,4,'UKR000000000023148',21,1),(328,'Записки кирпатого Мефістофеля','Володимир Винниченко — бунтар української літератури початку ХХ століття. Він спровокував чимало інтелектуальних конфліктів, та водночас побудував неймовірну літературну й політичну кар’єру. Винниченко став популярним драматургом, автором романів, статей, мемуарів, а в 1917 році очолив Генеральний Секретаріат Центральної Ради. «Записки Кирпатого Мефістофеля» — роман морального експерименту, у якому чи не вперше в українській літературі відверто аналізуються стосунки між чоловіком і жінкою. Герой, який хоче позбутися власної дитини, бо не бажає бути батьком. Жінка, яка відмовляється робити аборт. Небажана дитина, що зрештою стає психологічним прихистком для головного героя. Автор тестує своє кредо «роби, що хочеш, коли тебе не мучать докори сумління» та шукає межі особистої свободи у стосунках. Про серію «Неканонічний канон» Міркуючи про канон української літератури, в пам’яті спливають лише кілька прізвищ зі шкільної програми — Шевченко, Франко, Нечуй-Левицький. Хоча насправді цей перелік значно більший та різноманітніший. Перед вами серія «Неканонічний канон», за допомогою якої ми хочемо поговорити про всіх тих, кого ми не знали, чиї тексти ми читали, не розуміючи контексту тогочасної реальності. Перед вами серія, покликана перевідкрити знайомих незнайомців. У ній ви знайдете цілий спектр українських авторів та їхніх творів — від Підмогильного і Багряного до Хвильового та Йогансена, від вишуканого інтелектуального роману до динамічного пригодницького, від новаторської урбаністичної прози до психологічних текстів. Кожен текст супроводжується ключами для прочитання від українських літературознавців. Вони розкажуть, на що варто звернути увагу, і допоможуть подивитися на тексти українських класиків по-новому.','978-617-7960-94-1',0,249.00000000,6,'UKR000000000105611',22,6),(190,'Федько-халамидник. Момент. Вибрані твори','Кожне з наведених у пропонованій збірці ранніх оповідань Володимира Винниченка (1880—1951) — це зворушлива і яскрава розповідь про драматичну долю людини. Письменник із симпатією змальовує і простих “маленьких” людей, які є носіями найкращих начал народного буття (“Федько-халамидник”, “Раб краси”), і людей освічених, романтичних і водночас рішучих у відстоюванні високих ідеалів (“Момент”, “Зіна”). Разом з тим він далекий від сентиментального замилування і часом безжально сатиричний у зображенні рідного українства, проявів самозакоханості чи пристосуванства (“Уміркований” та “щирий”). Ці оповідання належать до найкращої частини творчої спадщини письменника та зберігають свою художню цінність і сьогодні.','978-617-07-0738-3',0,132.00000000,9,'UKR000000000023691',23,7),(352,'Чарівні істоти українського міфу. Домашні духи','Книжка «Чарівні істоти українського міфу: домашні духи» поведе вас у дивовижний і самобутній світ українських вірувань. Гортаючи її сторінки, ви дізнаєтесь про поважного домовика, надійного захисника роду, познайоми-_x000D_ тесь із добрим покутнім, який нашепче вам своє благословення, зазирнете на гостину до справедливого хлівника, який доброму господареві в усьому сприяє, а ледацюг карає. А якщо поталанить, привабите духа щастя з удатною_x000D_ сприйєю, які підуть пліч-о-пліч з вами. Однак стережіться роздоріжжя, бо там духи-перевертні заманюють у потойбіччя стомлених мандрівників._x000D_ Перед вами постане величний шар культурної спадщини давніх українців,химерний світ чарівних істот праукраїнської міфології, досліджений і опрацьований Дарою Корній.','978-966-982-012-9',0,480.00000000,14,'UKR000000000020724',24,8),(336,'Чарівні істоти українського міфу. Шкідники життя','У правіки сягає корінням віра в те, що і в небі, і не землі порядкують надприродні сили й повно всякого дива. І не завжди та сила добра й прихильна до людей. Дара Корній поведе вас у самобутній і моторошний світ, у якому уява наших пращурів пояснювала всі негаразди й болячки втручанням «нечистої сили». Ви помандруєте українськими теренами й дізнаєтесь, що це нічниці крадуть у дітей сон, злидні та хвацько однооке відбирають у родини достаток, а літавиця й перелесник — душевний спокій; пересвідчитесь, що сестри-лихоманки приносять хвороби й моровиці, насилають голод, а лиха удільниця може наперекір долі позбавити людину життя. Перед вами постане величезний шар культурної спадщини давніх українців, який може видатися надто похмурим. Разом із тим він повчальний, адже покликаний не налякати, а застерегти людину від необдуманих учинків, лихих намірів, підступу та зради.Тож цікавої мандрівки примарним світом праукраїнського міфу!','978-966-982-118-8',0,460.00000000,6,'UKR000000000024719',25,8),(240,'Пригоди Змія Багатоголового. Діти Сонцівни й молодильні яблука','Скелястий Світ Вічного Літа населяють мудрі змії та дракони, які подолали заздрість і живуть у гармонії та злагоді, кожен має своє призначення й шанує закон. Однак несподівано цей чарівний Світ спіткало лихо: у Райському саду захворіли жар-птиці й вертоград із молодильними яблуками занедужав. Про це дізнаються друзі — юні Мотузочка й трьохголовий змій, якого всі називають Халепником за бешкетний норов. І строката компанія рушає у світ людей, щоб дізнатися правду й завадити непоправній катастрофі. Читачі не тільки зануряться у плетиво незвичайних пригод, а й навчаться цінувати дружбу й дослухатися до свого серця. І ще переконаються в істинності заповідей Скелястого Світу, особливо в тому, що любов і повага до матінки Землі — понад усе.','978-966-982-186-7',0,320.00000000,9,'UKR000000000025239',26,8),(40,'Бузинова сопілка діда Всевіда','Ця добра казочка про всесильного діда Всевіда, який живе у старому Пралісі, мешкає у бузиновій хатинці, грає на чарівній бузиновій сопілці та товаришує з сестрами Весною, Осінню, Зимою та Літом. Одного сніжного зимового дня хтось поцупив дідову бузинову сопілку і у Пралісі все переплуталося — суниці посеред стужі, журавлині ключі у зимовому небі, розквітлі конвалії на галявині, де ще мить тому лежав сніг... До всього, у пісочному годиннику світу час зупинився. Як це виправити? Хто він — той загадковий крадій? І для чого йому чарівна сопілка діда Всевіда?','978-617-629-530-3',0,190.00000000,2,'UKR000000000100235',27,3),(40,'Особливий','Навіть якщо ти один з тисячі, копія своїх братів-сестер, бо народився кленовим листочком, і тобі від народження пророкують сумне та нецікаве життя, це не привід журитися. Щойно ти повіриш у власну унікальність, як усе зміниться. Ця історія про віру в себе, яка слабких робить сильними, зневірених перетворює на героїв. І звичайні стають Особливими.','978-617-7429-37-0',0,120.00000000,3,'UKR000000000027445',28,3);
/*!40000 ALTER TABLE `book` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_file`
--

LOCK TABLES `book_file` WRITE;
/*!40000 ALTER TABLE `book_file` DISABLE KEYS */;
INSERT INTO `book_file` VALUES (1,1),(2,2),(3,3),(3,4),(4,5),(5,6),(6,7),(7,8),(8,9),(9,10),(10,11),(11,12),(12,13),(13,14),(14,15),(15,16),(16,17),(17,18),(18,19),(19,20),(20,21),(20,22),(20,23),(21,24),(22,25),(23,26),(23,27),(24,28),(25,29),(26,30),(27,31),(28,32);
/*!40000 ALTER TABLE `book_file` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_genre`
--

LOCK TABLES `book_genre` WRITE;
/*!40000 ALTER TABLE `book_genre` DISABLE KEYS */;
INSERT INTO `book_genre` VALUES (1,1),(5,1),(11,1),(12,1),(13,1),(15,1),(16,1),(19,1),(22,1),(23,1),(1,2),(2,2),(4,3),(7,3),(8,3),(9,3),(10,3),(6,4),(14,5),(17,6),(18,7),(20,8),(21,9),(24,10),(25,11),(26,11),(27,11),(28,11),(3,12);
/*!40000 ALTER TABLE `book_genre` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review`
--

LOCK TABLES `book_review` WRITE;
/*!40000 ALTER TABLE `book_review` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_review` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_characteristic`
--

LOCK TABLES `book_review_characteristic` WRITE;
/*!40000 ALTER TABLE `book_review_characteristic` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_review_characteristic` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_draft`
--

LOCK TABLES `book_review_draft` WRITE;
/*!40000 ALTER TABLE `book_review_draft` DISABLE KEYS */;
INSERT INTO `book_review_draft` VALUES ('\"Особливий\" - це захоплива і емоційно збагачена книга, написана авторкою Дарою Корній. Цей твір дарує читачеві незабутню подорож у світ фантазії та внутрішнього розвитку головного героя.\nУ цій книзі ми зустрічаємося з Олегом, хлопчиком, який має особливі здібності. Його життя повне викликів та труднощів, але він виявляється сильним і витривалим, шукаючи своє місце у світі. За допомогою своїх особливих здібностей, Олег вступає на шлях самовідкриття, дружби та пригод.\nДара Корній майстерно побудовує сюжет, розкриваючи внутрішній світ головного героя та його емоційний розвиток. Через вміле використання описів та діалогів, авторка передає читачеві глибину почуттів та думок головного героя. Ми співпереживаємо разом з Олегом, відчуваємо його радощі та сумніви, і захоплюємося його зростанням та самовизначенням.\n\"Особливий\" - це не просто фантастичний твір, але й історія про важливість прийняття себе таким, яким ми є, та відкриття свого потенціалу. Ця книга надихає читачів на віру в себе, розвиває творчість та впливає на пізнання власного внутрішнього світу.\nЗавдяки чарівному переплетенню фантазії, пригод і важливих життєвих моментів, \"Особливий\" стає чудовим читанням як для молодших, так і для старших читачів. Рекомендую цей твір усім, хто бажає зануритися в захопливий світ фантазії та знайти інспірацію для розвитку своїх особистих якостей.\n','Прийняти себе',NULL,28,129,9,'2023-05-08 21:45:30'),('\"Бузинова сопілка діда Всевіда\" - це надзвичайно зворушлива історія, яка переносить нас у світ української народної казки та магії. Авторка Дара Корній знову дарує нам незабутнє літературне досвід, використовуючи народні мотиви та символіку.\nУ цій казці ми знайомимося з дідом Всевідом, який зіграє ключову роль у розвитку подій. Він знає все, бачить все і володіє таємницями бузинової сопілки, яка може здійснити бажання. Захоплююча пригода розгортається, коли маленький герой потрапляє у владу магічного інструменту та стикається з різними випробуваннями.\nДара Корній вміло створює відтінки персонажів, дозволяючи нам співчувати їх радощам і турботам. Вона розповідає про значення родинних зв\'язків, взаємодії поколінь та мудрості, яка може бути надана дідами та бабусями. Авторка передає глибокий зв\'язок і взаєморозуміння між дідом Всевідом і маленьким героєм, створюючи емоційно збагачений наратив.\n\"Бузинова сопілка діда Всевіда\" не тільки вирізняється своїм захоплюючим сюжетом, але й має глибоке значення. Вона нагадує нам про важливість віри, добра, справедливості та допомоги один одному. Ця казка розкриває нам таємниці української культури та народної мудрості, а також залишає в нас почуття тепла та надії.\n\"Бузинова сопілка діда Всевіда\" - це ще один неперевершений твір від Дари Корній, який рекомендую як читачам молодшого віку, так і дорослим, які хочуть зануритися у світ магії та відчути волшебство на власній шкірі.\n','Українська магія','justCoolReader',27,130,9,'2021-12-14 22:49:02'),('\"Чорна рада: Хроніка 1663 року\" - захоплююча історична книга, яка привертає увагу читача з перших сторінок і відтворює життя та події загадкового періоду в українській історії. Автор, використовуючи ретельне дослідження історичних джерел, переносить нас у часи, коли Україна переживала складні перетрубації під час Хмельниччини, а саме - у рік 1663, коли відбулася видатна подія - заснування Чорної ради.\nАвтор майстерно викладає події того часу, втілюючи їх у яскравих образах і багатих описах. Він надає читачеві можливість зануритися у життя козацької старшини, почути голоси героїв та відчути атмосферу напруженості та боротьби за волю. Оповідання про чорнорадійців, їхні розбірки та конфлікти з полоненими шляхтичами зроблені настільки реалістичними, що читач майже почуває пил, чує шум битви та відчуває тривогу перед несподіваними поворотами сюжету.\nОдин з головних достоїнств книги полягає в тому, що автор показує не лише блискучу ілюстрацію подій, але й зосереджується на внутрішній боротьбі героїв. Він демонструє їхні мотивації, сумніви та роздуми, роблячи їх ближчими та зрозумілими для читача. Це надає книзі глибину і реалістичність, а також допомагає зрозуміти складність історичного періоду.\nМова, використана автором, багата та кольорова. Він вдається до використання архаїзмів та специфічної лексики того часу, що додає тексту аутентичності. В той же час, стиль письма є зрозумілим та доступним, не заважаючи проникнути в суть історії та пережити її разом з героями.\n\"Чорна рада: Хроніка 1663 року\" - книга, яка сподобається шанувальникам історії, але також буде цікава тим, хто просто любить захоплюючі пригоди та складні періоди минулого. Автор зумів створити живий світ, де реальність і фантазія переплітаються, а герої залишаються в пам\'яті надовго. Завдяки своєму витонченому стилю та захоплюючому сюжету, книга \"Чорна рада: Хроніка 1663 року\" є справжнім літературним шедевром, яке слід прочитати кожному, хто цікавиться історією та магією слова.\n','Подорож у хроніку ',NULL,12,131,10,'2022-11-03 22:51:03'),('\"Тигролови\" - захоплюючий пригодницький роман, який занурює читача у незабутню подорож через дикі джунглі та небезпечні сутички з тиграми. Автор цієї захопливої книги вдало поєднаває екзотичність природи з напруженою історією, створюючи справжній шедевр пригодницького жанру.\nГоловний герой, молодий дослідник Макс, вирушає на відпочинок до віддаленого тигрового заповідника у Східній Азії. Але його мирний відпочинок перетворюється на незабутню пригоду, коли він стикається з браконьєрами, які полюють на тигрів. Разом з місцевою групою захисників природи, він вирішує протистояти цим злочинцям і врятувати дику природу від винищення.\nАвтор майстерно розкриває образи героїв, надаючи їм глибину та реалістичність. Макс - сміливий, впевнений у собі та відданий своїй меті. Його взаємодія з іншими персонажами, особливо з місцевими жителями та членами групи захисників природи, дозволяє відчути силою їхнього об\'єднання та посильну боротьбу зі злочинцями. Кожен герой має свою історію, що робить їх живими та близькими читачу.\nОписи джунглів і їхньої розкішної, але небезпечної краси переносять читача у саме серце природи. Автор зображує шум лісу, запахи, атмосферу невідомого, змушуючи нас відчути напруження та небезпеку, які панують навколо. Відважність героїв, їхня боротьба зі стихіями і злочинцями, а також взаємодія з місцевими тваринами створюють непередбачувані ситуації та захоплюють увагу читача до самого фіналу.\n\"Тигролови\" - це книга, яка надихає, захоплює та залишає слід у серці. Вона розкриває прекрасну природу і дикість тваринного світу, а також підкреслює важливість охорони навколишнього середовища. Це історія про мужність, дружбу та важливість боротьби за те, вірно воно чи ні. \"Тигролови\" - це книга, яку варто прочитати всім прихильникам пригодницьких романів та тим, хто хоче відчути магію природи і впевнитися у силі людського духу.','Пригода',NULL,13,132,12,'2023-06-02 21:53:09'),('\"Земля Палтелеймона Куліша\" - це класична українська література, яка залишає незабутнє враження своєю глибиною та живими образами. Ця книга втілює в собі магію слова та змушує читача погрузнутися у світ минулого, де переплітаються любов, зрада, віра та справедливість.\nАвтор, Пантелеймон Куліш, майстерно розповідає історію селянського хлопця Палтелеймона, який бореться за справедливість і волю свого народу. Його подорож у пошуках справедливості пролягає через непрості випробування та невдачі, але він не здається й проймається глибоким почуттям любові до рідної землі та нації.\nМова, використана Кулішем, багата та поетична. Він майстерно описує українську природу, звичаї та менталітет селянського народу, надаючи тексту аутентичності та колориту. Кожен рядок книги переповнений почуттям, що вражає і захоплює.\n\"Земля Палтелеймона Куліша\" - це не просто історія одного хлопця, це епічна подорож через час та простір, яка розкриває перед нами життя українського села, його проблеми та боротьбу за свободу. Ця книга змушує нас задуматися над важливими питаннями, які актуальні й сьогодні - справедливість, національна гідність та самовизначення.\n\"Земля Палтелеймона Куліша\" - це твір, який повинен бути в кожній бібліотеці українського читача. Це книга, яка розкриває глибину української літератури, викликає в нас почуття гордості за свою культуру та захоплює своєю неповторною атмосферою. \"Земля Палтелеймона Куліша\" - це скарб, який треба відкрити і відчути його магію.','Класика рідна наша',NULL,11,133,18,'2023-10-01 21:57:42'),('\"Федько-халамидник\" - незабутнє оповідання від видатного українського письменника Володимира Винниченка, яке проникає в глибини людської душі та розкриває нам непередбачувані аспекти людської природи. Ця книга - подорож у світ внутрішніх почуттів, моральних конфліктів та величезного потенціалу людської сили.\nОповідання розповідає історію Федька, простого хлопця з маленького села, який змушений зіткнутися з жорстокими реаліями життя, бідністю та соціальною несправедливістю. Автор уміло розкриває протиріччя між добром і злом, між ідеалами та життєвими реаліями, показуючи, як навіть в найскладніших ситуаціях людина може знайти сили та відваги.\nМова, використана Володимиром Винниченком, вражає своєю простотою та водночас глибиною. Він майстерно передає емоції та становлення головного героя, надаючи тексту особливого колориту та автентичності.\n\"Федько-халамидник\" - це оповідання, яке змушує задуматися над важливими питаннями справедливості, соціальної рівності та внутрішньої сили людини. Воно викликає емоції та спонукає до роздумів про те, що кожна людина має в собі потенціал для змін і боротьби за свої права. \"Федько-халамидник\" - це шедевр, який залишить свій слід у серці кожного читача та надихне на нові відкриття.','Людська душа',NULL,20,134,12,'2022-02-02 22:57:22'),('\"Оля\" - це захоплююча та емоційно заряджена книга від талановитої письменниці Ольги Саліпи, яка переносить нас у світ фантазії та магії. Цей твір створює запаморочливу подорож уяви, а також пропонує читачеві незабутню подорож у світ самопізнання та розуміння власної сутності.\nГоловна героїня книги - Оля, звичайна дівчинка, яка виявляється обдарованою унікальними здібностями. Вона здатна зануритися в світ фантазії та мрій, де зустрічає незвичайних персонажів та стикається зі складними випробуваннями. Під час своєї подорожі Оля змушена зіткнутися зі своїми страхами, перебороти внутрішні бар\'єри та знайти в собі сили для розвитку і зростання.\nМова, використана Ольгою Саліпою, вражає своєю легкістю та емоційною насиченістю. Авторка майстерно передає внутрішній світ головної героїні, її думки, переживання та емоції. Кожне речення пронизане почуттями та створює живі образи перед очима читача.\n\"Оля\" - це не просто книга для дітей та підлітків, але й повчальний твір, який заохочує читача вірити у свої можливості, розвивати фантазію та пізнавати себе. Це історія про самовідкриття, дружбу, віру в себе та важливість бути самим собою.\nОльга Саліпа створила неперевершений світ, в якому кожна сторінка захоплює та залишає бажання продовжувати подорож разом з Олею. Її книга надихає маленьких та великих читачів дивитися на світ з новими очима, відкривати в собі нові можливості та вірити у свої мрії.\n\"Оля\" - це твір, який дарує радість читання, захоплює своєю магією та залишає позитивний слід у серці кожного, хто відчинить його сторінки. Це книга, яку варто прочитати і ділитися з іншими, адже вона має потужний потенціал вплинути на життя та мрії кожного читача.','Світ самопізнання',NULL,7,135,18,'2023-03-19 00:10:33'),('\"Я(Романтика)\" - захоплюючий та провокативний роман від відомого українського письменника Миколи Хвильового, який проникає в глибини людської душі та провокує читача задуматися над важливими питаннями самовизначення та пошуку власної ідентичності. Цей твір є одним з найвідоміших українських літературних шедеврів, який надихає та змушує читача переосмислити своє ставлення до життя та людей.\nРоман розповідає історію головного героя, який переживає внутрішню боротьбу, намагаючись знайти своє місце в світі та зрозуміти себе. Письменник використовує монолог в першій особі, дозволяючи нам зануритися в світ думок та почуттів героя. Через його очі ми бачимо життя, суспільні проблеми, політичні катаклізми та внутрішню розривання особистості.\nМова, використана Миколою Хвильовим, є виразною, образною та інтелектуальною. Автор майстерно використовує різноманітні стилістичні засоби, створюючи яскраві образи та передаючи глибину почуттів героя. Він викликає сумніви, пробуджує пізнання, а іноді й шокує своєю нетрадиційністю та провокативністю.\n\"Я(Романтика)\" - це не просто роман, а справжнє мистецтво слова, яке розкриває складність людської психології та вічні теми існування. Твір відкриває багатогранність людської природи, розповідаючи про самотність, страждання, бажання бути свободним і відчути себе живим у суспільстві, де іноді людина втрачає свою ідентичність та стає частиною системи.\nМикола Хвильовий зумів створити шедевр, який до цього часу залишається актуальним і приваблює своєю силою та витонченістю. \"Я(Романтика)\" - це роман, який вимагає уваги, відкритості та готовності до викликів. Він змушує читача думати, роздумувати та поставити під сумнів свої переконання.\nЦей твір може вразити, шокувати та перевернути уявлення про літературу. Він розкриває незвичайну глибину людської душі та провокує на пошук власного місця у світі. \"Я(Романтика)\" - це книга, яку варто прочитати всім, хто шукає нові емоції, розуміння себе та світу навколо.','Пошук ідентичності','NoBookNoLifeMan',5,136,18,'2023-06-08 23:10:27'),('Кніга \"Я, Паштєт і Армія\" Кузьми Скрябіна - це справжній вибух на фоні літературної сцени. Її сторінкі наповнені незвичайними та змішаними враженнями, що здатні зворушити навіть найвибагливішых читачів.\nСама кніга виділяєтся некоординованостю та хаосем у своїй структурі. Розповіді переплітаються одна з одною, безладно стрибаючи від одного моменту до іншого. Та цей цирк геніально виконаний, нагадуючи жонглювання фразами та думкамі.\nАвтор майстерно користуєтся лексичними непокорами, створюючи справжній конфуз між світами реальності та фантазії. Його вибуховий стиль, хоча й наповнений помилками, створює враження невпорядкованости, але в той же час приваблює увагу читачів.\nЧерез лексичні та стилістичні недоліки, кніга \"Я, Паштєт і Армія\" може здатися трішки незрозумілой та протирічливой. Одначе, саме ці помилки надают їй своєрідного шарму та атмосфери автентичности.\nТематика кніги охоплюе широкий спектр емоцій та переживань, від радості та веселощів до смутку та роздумів про сенс життя. Вона провокує читача до глибоких роздумів та саморефлексії, не зважаючи на каракули та недоліки, якими вона відзначена.\n\"Я, Паштєт і Армія\" - це виклик усім стандартам та канонам, що завдяки своїй розпутаності та невідповідності сприяє творчому розкриттю меж словесної творчості. Ця кніга - незабутній шедевр, який кожен любитель літератури повинен мати в своїй колекції.','Бєзумство слова',NULL,9,137,10,'2023-01-01 00:10:23'),('Книга \"Захар Беркут: образ громадського життя Карпатської Русі в XIII віці: історична повість\" від відомого українського письменника Івана Франка - це неймовірно захоплива літературна подорож у світ минулого. Автор зробив неймовірну роботу, розповідаючи історію героїв, які боролися за свободу та незалежність своєї землі.\nУ книзі фантастично відтворено образи громадського життя Карпатської Русі в XIII віці. Читачі занурюються в атмосферу давніх часів, де боротьба, віра і любов змінюють життя героїв назавжди. За допомогою багатого опису та живих діалогів, Франко вдало передає колорит епохи, відтворюючи образи природи та культури.\nАвтор ретельно досліджував історичні факти та деталі, що дозволило йому створити вірогідний світ, де кожен персонаж має свою унікальну характеристику та роль. Завдяки цьому, читачі можуть почути голоси героїв, переживати їх радощі та перепони, а також відчувати напруження, що панує в розділах битв та конфліктів.\nСтиль письма Івана Франка, як і в багатьох його творах, відрізняється виразністю та емоційністю. Його використання мовних засобів і образності додають глибину інтерпретації подій та персонажів. І хоча у деяких місцях можуть бути помилки в стилістиці та лексиці, це не зменшує загального враження від книги. Саме ці помилки відображають натуральність та неповторність українського мовлення того періоду.\nОдним з найсильніших аспектів книги є її здатність показати не тільки зовнішні події, але й внутрішній світ героїв. Читачі відчувають їхні страхи, мрії та сумніви, і це робить персонажів ближчими та зрозумілішими. Відносини між героями добре пророблені, а їхні почуття витікають з глибини душі, змушуючи нас переживати разом з ними кожен момент.\n\"Захар Беркут: образ громадського життя Карпатської Русі в XIII віці: історична повість\" - це відмінна книга, яка заслуговує на увагу любителів історії та пригод. Її хвилююча сюжетна лінія, живі персонажі та майстерне використання мови переносять нас в далеке минуле, де можна побачити міць і велич наших предків. Рекомендую цю книгу всім, хто цікавиться історією та хоче пірнути в захопливий світ Івана Франка.','Вічна класика',NULL,2,138,17,'2023-01-28 00:10:16'),('\"Євген Шишащьцикй Мандрівка до потойбіччя. Маріуполь\" - ця книга залишає на думці багато вражень. Автор майстерно розповідає про свою небезпечну подорож до Маріуполя, одного з найбільш зруйнованих і небезпечних міст України. Його висвітлення про те, як він ризикував своїм життям, щоб допомогти тим, хто опинився під обстрілами війни, вражає своєю чесністю та глибиною почуттів.\nКнига \"Мандрівка до потойбіччя. Маріуполь\" поєднує в собі описи військових дій, зворушливі розповіді про життя звичайних людей у військовому конфлікті, а також власні роздуми автора про його особисті переживання та пошуки. Шишащьцикй майстерно передає атмосферу жаху і безнадії, що панує в Маріуполі. Він розповідає про те, як люди намагаються вижити в умовах війни і не втратити свою гуманність і надію навіть у найважчі моменти.\nЦя книга захоплює своєю вразливістю і здатністю примусити читача задуматися про значення людської доброти та готовності допомагати одне одному в складних ситуаціях. \"Мандрівка до потойбіччя. Маріуполь\" - це не просто історія війни, а глибоке занурення в життя звичайних людей, які змушені жити в умовах конфлікту. Ця книга рекомендована для всіх, хто цікавиться історією України та хоче краще розуміти вплив війни на звичайних людей.\n\"Мандрівка до потойбіччя. Маріуполь\" - це важлива історія, яка вражає і розчулює. Ця книжка є невеликим, але потужним свідченням про жахи війни. Вона допомагає зрозуміти, що відбувається на окупованих територіях та яким чином люди намагаються зберегти своє гуманне обличчя в умовах військового конфлікту. Рекомендуємо цю книгу всім, хто цікавиться літературою про воєнні події в Україні та хоче розширити своє розуміння цих складних подій.','Жах війни',NULL,10,139,9,'2023-01-20 00:10:49'),('\"І будуть люди\" Анатолія Дімарова - це захоплива книга, яка проникає в глибину людського буття та розкриває його непередбачувані аспекти. Роман привертає увагу читача своєю проникливістю, надзвичайною глибиною та реалізмом.\nАвтор вміло побудував сюжет, який охоплює широкий спектр життєвих ситуацій та драматичних подій. Головний герой, із самим собою ведучи внутрішній монолог, опиняється перед важливими життєвими виборами та моральними дилемами. Відчуття реальності та живої емоційності викликають максимальну ідентифікацію з персонажами, а їхні дії та роздуми розкривають різні аспекти людської природи.\nДімаров пише з докладними описами та витонченими емоційними нюансами, що додає книзі особливого колориту. Мова автора чарівна, здатна перенести читача у саму суть подій та почуттів персонажів. Реалістичний стиль письма Анатолія Дімарова підкреслює значимість кожної миті у житті людини та розкриває проблеми, з якими зіштовхуються всі.\nУ романі \"І будуть люди\" розглядаються важливі соціальні та моральні питання, такі як відповідальність, любов, справедливість та взаємини між людьми. Автор збагачує сюжет різними конфліктами, які розкривають недосконалість людського існування та його пошук сенсу. Роман спонукає читача задуматися про власне ставлення до цих питань та пробуджує в ньому глибокі роздуми.\nОсобливу увагу варто звернути на витончений характеропис автора. Герої роману \"І будуть люди\" відрізняються своєю унікальністю та глибиною. Кожен персонаж має свої мотивації, таємниці та суперечності, що робить їх вірогідними й непередбачуваними. Читач легко співпереживає їхнім радощам і болю, що зробило роман особливо живим та інтенсивним.\n\"І будуть люди\" Анатолія Дімарова - це вагомий внесок у сучасну українську літературу. Ця книга вразлива, мудра та сповнена проникливості. Вона стимулює читача до власного роздуму над глибиною людського буття та значимості наших вчинків. Роман рекомендується всім, хто прагне зануритися в глибини людської душі та зрозуміти непередбачуваність людського існування.','Трагічна реальність',NULL,4,140,14,'2023-02-21 00:10:10'),('\"Пригоди Змія Багатоголового. Діти Сонцівни й молодильні яблука\" Дари Корній - це захоплива книга, що оживає уяву та переносить нас у світ фантазії та пригод. Це незабутня історія про дружбу, магію та відважність, яка залишається в серці читача надовго.\nАвтор вміло розповідає про пригоди головних героїв - Змія Багатоголового і Діти Сонцівни, які вирушають у небезпечну мандрівку, щоб знайти молодильні яблука та врятувати своє село від страшного прокляття. Кожна сторінка книги сповнена неймовірних пригод, таємниць та несподіваних поворотів сюжету, що тримають читача в напрузі до останньої сторінки.\nДара Корній створила унікальний світ, в якому розквітає магія та фантастика. Її яскравий опис та деталізація кожної події захоплюють читача, переносячи його у вигаданий світ, наповнений загадковими істотами, чарівними предметами та чарівними місцями. Автор майстерно поєднує фантастичні елементи з емоційними викликами та розвитком персонажів, роблячи їх реальними та запам\'ятовуючими.\n\"Пригоди Змія Багатоголового. Діти Сонцівни й молодильні яблука\" пропонує глибокі моральні висновки та важливі життєві уроки. Це не просто казка, а й натхненна історія про сміливість, віру в себе та важливість дружби. Книга надихає маленьких і великих читачів дотримуватися своїх цілей, переборювати перешкоди та довіряти власним силам.\nМова, використана в книзі, проста та доступна, що робить її зрозумілою для різних вікових категорій читачів. Дара Корній чарівно втілює свої ідеї та фантазії у художньому стилі письма, що робить кожну сторінку книги захоплюючою та зацікавлюючою.\nУзагалі, \"Пригоди Змія Багатоголового. Діти Сонцівни й молодильні яблука\" Дари Корній - це чарівна книга, яка спонукає читача мріяти, відкривати нові світи та вірити в чудеса. Вона неперевершений вибір для всіх, хто любить фантастичні пригоди, магію та великі пошуки. Рекомендуємо цю книгу як незабутнє літературне досвід для всієї родини, яка запалить уяву та надихне на нові враження.','Магічна пригода',NULL,18,141,13,'2023-02-16 00:10:42'),('\"Неофіційна кулінарна книга Гаррі Поттера\" від Діни Бухольц - це захоплююча кулінарна подорож до світу чарівницьких страв і напоїв, які зачаровують нас у книгах та фільмах про Гаррі Поттера. Ця книга - справжнє скарбниця рецептів, які допоможуть втілити магію в нашій власній кухні.\nАвтор, Діна Бухольц, пропонує нам не тільки відомі страви, які з\'являлися на сторінках книг та в кадрах фільмів, але й оригінальні рецепти, інспіровані магічним світом Гаррі Поттера. Вона вміло комбінує кулінарну фантазію та любов до цього унікального літературного світу, створюючи страви, які не тільки задовольнять наші смакові рецептори, але й привнесуть нотку магії у наше повсякденне життя.\nКожен рецепт книги чудово описаний і супроводжується чарівними фотографіями, що робить їх більш захоплюючими та змушує нас прагнути втілити їх у життя. Від печива \"Пивний доріжки\" до \"Кишені з місяцем\" - кожна страва пропонує нам незабутню гастрономічну подорож.\nКнига не лише пропонує рецепти, але й ділиться цікавими фактами про кулінарну культуру магічного світу, історіями з сумісних застіль, а також корисними порадами щодо кулінарної магії. Вона перетворить вашу кухню на справжню \"чарівну лабораторію\", де ви зможете творити дива та вражати своїх гостей.\n\"Неофіційна кулінарна книга Гаррі Поттера\" Діни Бухольц - це не просто книга з рецептами, це чарівна подорож до світу Гаррі Поттера, де магія перетинається з кулінарією. Вона здатна збудити в нас дитячу захопленість та віру в те, що навіть звичайні страви можуть бути особливими, якщо додати до них краплину магії.\nРекомендуємо цю книгу як шанувальникам Гаррі Поттера, так і всім, хто цікавиться кулінарією та хоче проникнутися магією щоденного життя. Вона стане прекрасним подарунком для справжніх гурманів і фанатів казкового світу. Завдяки цій книзі ми зможемо пережити магію Гаррі Поттера не лише у кіно, але й у наших власних кухнях.','Смачно та чарівно',NULL,3,142,18,'2023-05-31 23:10:07'),('\"Василь Крас. Руіна\" - захоплюючі історична повість, яка переміщає читача в епоху трагічних подій української історії. Автор, неперевершений майстер літер, вдало комбінує факти і художню вигадку, відкриваєчі перед нами драматичні листи минулого.\nКнига розповідає про Василя Краса, перса, що втілює в собі мужність, відвагу і жагу до свободи. Ми стежимо за його шляхом, спостерігаємо за його змаганнями та переживаємо разом з ним. Автор здатний передати нам кожне почуття, кожну емоцію, зробивши нас співучасниками тих подій.\nРуїна - це не просто розповідь про війну і руйнування. Це також історія про відданість, силу духу і непохитну віру в краще майбутнє. Автор прекрасно передає атмосферу того часу, збагачуючи нас враженнями від життя людей, їхніми труднощами і перемогами.\nОписи місцевості, атмосфери та характерів героїв неймовірно живі і колоритні. Ми можемо відчути запахи, почути звуки, побачити красу природи і руйнування, які оточували героїв. Автор майстерно переносить нас у той час і місце, роблячи нас свідками подій, які назавжди залишили свій слід у нашій історії.\n\"Василь Крас. Руїна\" - це книга, яка змушує задуматися про цінності життя, про мужність і самопожертву, про те, як малі вчинки можуть змінити хід історії. Це величезна подорож у минуле, яка розширює наше розуміння історії України і збагачує нашу душу.\nРаджимо \"Василь Крас. Руїна\" всім, хто цікавиться історією, хто бажає зануритися в атмосферу минулого та пережити великі події разом зі справжніми героями. Ця книга залишить вам незабутні враження і надихне на нові дослідження і роздуми.\n','Війна та відданість','honestReader34',6,143,18,'2023-06-02 23:10:03'),('Книга \"Я (Романтика)\" Миколи Хвильового - шедевр української літератури, який надихає, викликає запитання і провокує до глибоких роздумів. Це твір, який відчутно відрізняється від традиційного письма свого часу та має особливу значущість у контексті літературної модерністської епохи.\n\"Я (Романтика)\" є твором, що складається зі стислих фраз, діалогів та внутрішніх монологів героя. Така структура викликає асоціації зі складними мозаїками та загадковими головоломками. Вона дозволяє читачеві побачити світ очима головного героя, відчути його внутрішній світ і відчуття. Кожне слово має значення і наповнене емоціями.\nРомантична складова книги розкривається через постійний пошук героя - пошук себе, свого місця у світі, своєї істинності. Через втрати, падіння і піднесення герой виявляє свою сутність та прагне до самовиявлення. Він прагне до екстазу, до стану безсмертя та вищої реальності.\nКнига \"Я (Романтика)\" порушує широкий спектр тем, таких як мистецтво, любов, смерть, сексуальність і багато інших. Автор здатний передати глибокі почуття та відчуття героя, його бажання перетворити своє життя в витвір мистецтва.\nУ творі важлива роль відводиться мові та стилю письма. Хвильовий використовує експресивні прийоми, різні форми вираження та нестандартні мовні конструкції. Це створює унікальну атмосферу, що переносять читача у світ героя, де слово стає силою та знаряддям самовиразу.\nКнига \"Я (Романтика)\" Миколи Хвильового є сміливим та провокативним шедевром, який залишає слід у серцях читачів. Це величезна духовна подорож, яка ставить питання про сенс життя, існування та межі людської свободи. Її читання стимулює до роздумів, запалює творчість та відкриває нові горизонти сприйняття літератури. \"Я (Романтика)\" - це виклик для того, щоб ми зупинилися і задумалися про своє місце у світі та власну особистість.','Психологічний шедевр',NULL,5,144,11,'2023-02-01 00:08:38'),('\"Я, \"Побєда\" і Берлін\" - літературний дебют Кузьми Скрябіна, який здивував світ своєю витонченою поетичністю та глибиною емоцій. Цей збірник віршів, як перші кроки автора у літературному світі, вражає своєю оригінальністю та майстерністю виразу.\nУ \"Я, \"Побєда\" і Берлін\" Кузьма Скрябін створює світ, який переповнений поетичними образами, відчуттями та емоціями. Кожен вірш - це окремий погляд на світ, окрема історія, яка розкривається перед очима читача. Автор майстерно використовує слово, створюючи художні образи, які легко запам\'ятовуються та звучать у душі.\nУ цьому збірнику присутні різні тематики та настрої. Від радості та ейфорії до меланхолії та роздумів про сенс життя. Кожен вірш - це своєрідний відгук на життєві ситуації, наснага для саморефлексії та вираження власного \"я\". Кузьма Скрябін чутливо сприймає світ навколо себе та перетворює ці враження у поезію, яка впливає на душу та залишає слід у серці.\nМова Кузьми Скрябіна - це справжнє мистецтво. Він вміло вибирає слова, створюючи мелодійні ритми та глибокі образи. Він грає зі звучанням слів та використовує поетичні засоби, щоб передати свої почуття та емоції. Кожна строфа, кожний рядок - це витвір мистецтва, який здатний підкорити серце читача.\n\"Я, \"Побєда\" і Берлін\" є свідченням таланту Кузьми Скрябіна та його великого потенціалу у літературі. Цей збірник - це поетична подорож, яка запрошує читача в світ почуттів та роздумів. Кузьма Скрябін використовує мову поезії, щоб розповісти про свої думки, бажання та мрії.\n\"Я, \"Побєда\" і Берлін\" - це важливий твір української літератури, який заслуговує на увагу та визнання. Цей збірник віршів показує, що Кузьма Скрябін - не тільки талановитий музикант, але й обдарований поет, який здатний вразити своїми словами та донести до читача глибокий зміст.\nРекомендую \"Я, \"Побєда\" і Берлін\" всім, хто цікавиться літературою та хоче зануритися у світ поезії Кузьми Скрябіна. Цей збірник залишить слід у серці кожного, хто має бажання роздумати про життя, почуття та власне \"я\".','Запальний дубют',NULL,6,145,15,'2023-03-14 00:08:34'),('\"Руїни\" - захоплююча літературна подорож у світ мрій та реальності, створена талановитим автором Василем Красом. Ця книга вражає своєю глибиною, символікою і проникливістю, залишаючи незабутнє враження на кожного, хто має щастя її прочитати.\n\"Руїни\" розповідають історію про втрату і побудову заново. Головний герой, понурений в своїй самотності, розгублений у вирі власних думок та переживань, відправляється у подорож до своїх внутрішніх руїн. Це подорож, що розкриває перед нами картину життя з усіма його радостями і горем, мріями і реальністю.\nАвтор Василь Крас майстерно володіє мовою, створюючи образи й емоції, що переймають читача. Його проникливий стиль письма, збагачений виразними метафорами та образністю, дозволяє нам зануритися в глибину переживань героя. Кожен рядок наповнений відчуттям, емоціями та роздумами, що створюють магію слова.\nОдин із найсильніших аспектів \"Руїн\" - це його символічний зміст. Кожна подія, кожен образ має свою скриту сенсуальну значимість, яка витягає нас звідти, де ми звикли існувати, і переносить у світ метафізики та філософії. Це книга, яка закликає до роздумів, до самопізнання та розуміння світу навколо нас.\n\"Руїни\" є дивовижною симфонією слів та думок, що ведуть нас через заплутані стежки мрій і реальності. Через внутрішні переживання героя, ми самі переживаємо радощі і тугу, співчуваємо його болю та пошуку. Ця книга надихає нас змінити світ і водночас прийняти його таким, яким він є.\n\"Руїни\" Василя Краса - це твір, який залишає слід у серці кожного читача. Його вплив на наші почуття та роздуми незворотній. Ця книга надихає нас не лише зануритися у глибину слова, але й переглянути наше життя з нової перспективи. Вона показує, що навіть у руїнах можна знайти красу, а з втратою можна побудувати щось нове.\nРекомендую \"Руїни\" всім, хто цінує літературу, що викликає глибокі роздуми та перетворює наше сприйняття світу. Цей твір неодмінно змусить вас відчути його магію та вплив на ваше життя.','Мрії та реальність','JsoF4Gn',8,146,16,'2023-02-09 00:08:30'),('\"Тигролови\" - це роман, який несе в собі потужну силу та емоційне звучання. Він став одним із найвизначніших творів української літератури ХХ століття, захоплюючи читачів своєю сюжетною складністю, високим стильним виконанням та глибокими філософськими роздумами.\nРоман розповідає про трьох молодих людей - Василя Івановича, Григорія Семеновича та Льошу, які відправляються на небезпечну експедицію у пошуках рідкісного тигра. Протягом подорожі вони стикаються з безліччю випробувань, які перевіряють не лише їхню фізичну міць, але й духовну витривалість.\nОднією з ключових тем роману є взаємодія людини з природою. Автор майстерно передає магію та красу дикої природи, розкриваючи унікальну атмосферу джунглів. Природа стає не тільки фоном для подій, але й активним учасником роману, впливаючи на долю героїв і розкриваючи їхню внутрішню сутність.\nОкрім цього, \"Тигролови\" змальовують психологічні портрети головних героїв, які витісняють свої глибокі емоції та почуття. Іван Багряний вдається до глибокого аналізу психологічного стану героїв, розкриваючи їхні мотивації, переживання та інтелектуальний світ. Через це читач може співчувати їм, співпереживати їхнім радостям та трагедіям, а також зрозуміти складність їхніх внутрішніх конфліктів.\nМова, використана автором, має багатий лексичний арсенал та оригінальний стиль. Багряний грає словом, створюючи запаморочливі образи та поетичні описи природи. Його роман наповнений глибокими філософськими роздумами про сенс життя, природу людської душі та вічні питання про існування.\n\"Тигролови\" - це твір, який залишає незабутнє враження. Він провокує читача до глибоких роздумів про людську природу, життєві цінності та роль природи в нашому світі. Іван Багряний створив шедевр, який заслуговує нашої повної уваги та визнання. \"Тигролови\" - це книга, яку варто прочитати кожному, хто цінує високу літературу та пошук істини.','Красивий світ','Taras',13,147,17,'2022-08-02 23:08:21'),('\"Енеїда\" Івана Котляревського є визначним твором української літератури, який займає особливе місце в серцях читачів. Це геніальна пародія на класичну поему Вергілія \"Енеїда\", яка вдало поєднує гумор, сатиру та гостроту соціальних коментарів.\nПоема розповідає про пригоди головного героя Енея, який після падіння Трої вирушає в подорож до Карпат. Він зустрічається з різними персонажами, які втілюють різні аспекти українського суспільства того часу. Котляревський майстерно коментує політичну, соціальну та моральну ситуацію, висміюючи негативні аспекти суспільного життя.\nОдним з головних досягнень \"Енеїди\" є мовний геній Котляревського. Він використовує народну мову та народні вислови, створюючи неповторний колорит української розмовної мови. Котляревський навмисно порушує літературні норми, щоб передати свіжість та живість українського народу.\nУ \"Енеїді\" присутні яскраві гумористичні сцени та жваві діалоги, які розсмішують читача. Однак, за сатиричними висміюваннями ховається глибока філософія, яка заставляє задуматися над важливими питаннями людського життя та суспільства.\n\"Енеїда\" Івана Котляревського є вагомим внеском української літератури. Вона відкрила нові можливості для розвитку української мови та літератури, підвищила престиж української культури. Твір став національним скарбом, символом національної ідентичності.\n\"Енеїда\" є важливим для розуміння української культури та історії. Вона допомагає зберегти та передати наступним поколінням цінність традицій, народних звичаїв та мови.\nРоман Івана Котляревського \"Енеїда\" - це шедевр, який завойовує серця читачів своєю оригінальністю, глибиною та гостротою. Це веселий, але водночас серйозний твір, який став не тільки літературним явищем, а й символом українського народу. Рекомендую \"Енеїду\" усім, хто цікавиться українською літературою та бажає зануритися в неповторний світ Котляревського.','Гумористичні козаки',NULL,14,148,14,'2021-03-09 00:08:16');
/*!40000 ALTER TABLE `book_review_draft` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_edited`
--

LOCK TABLES `book_review_edited` WRITE;
/*!40000 ALTER TABLE `book_review_edited` DISABLE KEYS */;
INSERT INTO `book_review_edited` VALUES ('\"Василь Крас. Руїна\" - захоплююча історична повість, яка переносить читача в епоху трагічних подій української історії. Автор, неперевершений майстер слова, вдало поєднує факти і художню вигадку, розкриваючи перед нами драматичні сторінки минулого.\nКнига розповідає про Василя Краса, персонажа, який втілює в собі мужність, відвагу і жагу до свободи. Ми стежимо за його шляхом, спостерігаємо за його змаганнями та переживаємо разом з ним. Автор здатний передати нам кожне почуття, кожну емоцію, зробивши нас співучасниками тих подій.\nРуїна - це не просто розповідь про війну і руйнування. Це також історія про відданість, силу духу і непохитну віру в краще майбутнє. Автор прекрасно передає атмосферу того часу, збагачуючи нас враженнями від життя людей, їхніми труднощами і перемогами.\nОписи місцевості, атмосфери та характерів героїв неймовірно живі і колоритні. Ми можемо відчути запахи, почути звуки, побачити красу природи і руйнування, які оточували героїв. Автор майстерно переносить нас у той час і місце, роблячи нас свідками подій, які назавжди залишили свій слід у нашій історії.\n\"Василь Крас. Руїна\" - це книга, яка змушує задуматися про цінності життя, про мужність і самопожертву, про те, як малі вчинки можуть змінити хід історії. Це величезна подорож у минуле, яка розширює наше розуміння історії України і збагачує нашу душу.\nРекомендуємо \"Василь Крас. Руїна\" всім, хто цікавиться історією, хто бажає зануритися в атмосферу минулого та пережити великі події разом зі справжніми героями. Ця книга залишить вам незабутні враження і надихне на нові дослідження і роздуми.\n',1),('Книга \"Я, Паштєт і Армія\" Кузьми Скрябіна - це справжній вибух на фоні літературної сцени. Її сторінки насичені незвичайними та змішаними враженнями, що здатні зворушити навіть найвибагливіших читачів.\nСама книга відрізняється некоординованістю та хаосом у своїй структурі. Розповіді переплітаються одна з одною, безладно стрибаючи від одного моменту до іншого. Але цей цирк геніально виконаний, нагадуючи жонглювання фразами та думками.\nАвтор майстерно користується лексичними непослухами, створюючи справжнє протиріччя між світами реальності та фантазії. Його вибуховий стиль, хоч і наповнений помилками, створює враження невпорядкованості, але в той же час приваблює увагу читачів.\nЧерез лексичні та стилістичні недоліки, книга \"Я, Паштєт і Армія\" може здатися трохи незрозумілою та протирічливою. Однак, саме ці помилки надають їй своєрідний шарм та атмосферу автентичності.\nТематика книги охоплює широкий спектр емоцій та переживань, від радості та веселощів до смутку та роздумів про сенс життя. Вона провокує читача до глибоких роздумів та саморефлексії, не зважаючи на каракули та недоліки, якими вона відзначена.\n\"Я, Паштєт і Армія\" - це виклик усім стандартам та канонам, що завдяки своїй розпутаності та невідповідності сприяє творчому розкриттю меж словесної творчості. Ця книга - незабутній шедевр, який кожен любитель літератури повинен мати в своїй колекції.\n',2);
/*!40000 ALTER TABLE `book_review_edited` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_final`
--

LOCK TABLES `book_review_final` WRITE;
/*!40000 ALTER TABLE `book_review_final` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_review_final` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_request_for_checking`
--

LOCK TABLES `book_review_request_for_checking` WRITE;
/*!40000 ALTER TABLE `book_review_request_for_checking` DISABLE KEYS */;
INSERT INTO `book_review_request_for_checking` VALUES (NULL,3,19,143,1),(NULL,3,20,137,2),(NULL,1,NULL,130,3),(NULL,1,NULL,129,4),(NULL,1,NULL,132,5),(NULL,4,21,134,6),(NULL,5,21,135,7),(NULL,4,19,133,8),(NULL,7,20,139,13),(NULL,1,NULL,140,14),(NULL,7,19,138,15),(NULL,5,20,142,16),(NULL,5,21,141,17),(NULL,5,21,136,18),(NULL,1,NULL,148,20),(NULL,2,19,145,21),(NULL,2,20,144,22),(NULL,7,19,146,23),(NULL,1,NULL,147,24);
/*!40000 ALTER TABLE `book_review_request_for_checking` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_request_for_checking_review_requirement`
--

LOCK TABLES `book_review_request_for_checking_review_requirement` WRITE;
/*!40000 ALTER TABLE `book_review_request_for_checking_review_requirement` DISABLE KEYS */;
INSERT INTO `book_review_request_for_checking_review_requirement` VALUES (1,1,0),(1,2,1),(1,3,1),(1,4,0),(1,5,1),(1,6,1),(1,7,1),(1,8,1),(2,1,0),(2,2,1),(2,3,0),(2,4,0),(2,5,1),(2,6,1),(2,7,1),(2,8,1),(6,1,1),(6,2,0),(6,3,1),(6,4,1),(6,5,1),(6,6,1),(6,7,1),(6,8,1),(15,1,1),(15,2,1),(15,3,1),(15,4,1),(15,5,0),(15,6,1),(15,7,0),(15,8,1);
/*!40000 ALTER TABLE `book_review_request_for_checking_review_requirement` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_request_for_checking_status`
--

LOCK TABLES `book_review_request_for_checking_status` WRITE;
/*!40000 ALTER TABLE `book_review_request_for_checking_status` DISABLE KEYS */;
INSERT INTO `book_review_request_for_checking_status` VALUES (1,'Чекає на розгляд'),(2,'Перевіряється'),(3,'Відредаговано'),(4,'Перевірено'),(5,'Повернуто до клієнта'),(6,'Відхилено клієнтом'),(7,'Відхилено');
/*!40000 ALTER TABLE `book_review_request_for_checking_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_request_for_publication`
--

LOCK TABLES `book_review_request_for_publication` WRITE;
/*!40000 ALTER TABLE `book_review_request_for_publication` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_review_request_for_publication` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_request_for_publication_characteristic`
--

LOCK TABLES `book_review_request_for_publication_characteristic` WRITE;
/*!40000 ALTER TABLE `book_review_request_for_publication_characteristic` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_review_request_for_publication_characteristic` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_request_for_publication_criterion_score`
--

LOCK TABLES `book_review_request_for_publication_criterion_score` WRITE;
/*!40000 ALTER TABLE `book_review_request_for_publication_criterion_score` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_review_request_for_publication_criterion_score` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_request_for_publication_status`
--

LOCK TABLES `book_review_request_for_publication_status` WRITE;
/*!40000 ALTER TABLE `book_review_request_for_publication_status` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_review_request_for_publication_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_requirement`
--

LOCK TABLES `book_review_requirement` WRITE;
/*!40000 ALTER TABLE `book_review_requirement` DISABLE KEYS */;
INSERT INTO `book_review_requirement` VALUES (1,'Граматичних помилок не більше 20','Перевірка відповідності до граматичних норм.'),(2,'Структурована','Оцінка стилістичної якості та плавності викладу у рецензії'),(3,'Містить не більше 15 пунктуаційних помилок','Перевірка використання розділових знаків у тексті'),(4,'Містить не більше 10 орфографічних помилок','Перевірка відповідності до орфографічних норм.'),(5,'Не підтримує збройну агресію РФ','Перевірка відсутності будь-яких форм підтримки або симпатії до збройної агресії з боку рф'),(6,'Відсутність спойлерів','Перевірка чи рецензія на книгу не розкриває сюжетні важливі деталі, що можуть зіпсувати іншим читачам враження'),(7,'Відсутність образливих висловлювань','Перевірка чи рецензія не містить образливих, зневажливих висловлювань до особистості '),(8,'Дотримання авторських прав','Перевірка чи рецензія дотримується авторські права, не копією великі уривки з книги');
/*!40000 ALTER TABLE `book_review_requirement` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_score_criterion`
--

LOCK TABLES `book_review_score_criterion` WRITE;
/*!40000 ALTER TABLE `book_review_score_criterion` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_review_score_criterion` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_tag`
--

LOCK TABLES `book_review_tag` WRITE;
/*!40000 ALTER TABLE `book_review_tag` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_review_tag` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `book_review_with_tag`
--

LOCK TABLES `book_review_with_tag` WRITE;
/*!40000 ALTER TABLE `book_review_with_tag` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_review_with_tag` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `buyer_contact`
--

LOCK TABLES `buyer_contact` WRITE;
/*!40000 ALTER TABLE `buyer_contact` DISABLE KEYS */;
/*!40000 ALTER TABLE `buyer_contact` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `card_payment`
--

LOCK TABLES `card_payment` WRITE;
/*!40000 ALTER TABLE `card_payment` DISABLE KEYS */;
/*!40000 ALTER TABLE `card_payment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `card_returned_funds_payment`
--

LOCK TABLES `card_returned_funds_payment` WRITE;
/*!40000 ALTER TABLE `card_returned_funds_payment` DISABLE KEYS */;
/*!40000 ALTER TABLE `card_returned_funds_payment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `cart`
--z

LOCK TABLES `cart` WRITE;
/*!40000 ALTER TABLE `cart` DISABLE KEYS */;
/*!40000 ALTER TABLE `cart` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `cart_item`
--

LOCK TABLES `cart_item` WRITE;
/*!40000 ALTER TABLE `cart_item` DISABLE KEYS */;
/*!40000 ALTER TABLE `cart_item` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `cash_on_delivery_payment`
--

LOCK TABLES `cash_on_delivery_payment` WRITE;
/*!40000 ALTER TABLE `cash_on_delivery_payment` DISABLE KEYS */;
/*!40000 ALTER TABLE `cash_on_delivery_payment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `cash_payment`
--

LOCK TABLES `cash_payment` WRITE;
/*!40000 ALTER TABLE `cash_payment` DISABLE KEYS */;
/*!40000 ALTER TABLE `cash_payment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `cash_returned_funds_payment`
--

LOCK TABLES `cash_returned_funds_payment` WRITE;
/*!40000 ALTER TABLE `cash_returned_funds_payment` DISABLE KEYS */;
/*!40000 ALTER TABLE `cash_returned_funds_payment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `client`
--

LOCK TABLES `client` WRITE;
/*!40000 ALTER TABLE `client` DISABLE KEYS */;
INSERT INTO `client` VALUES (0,9),(0,10),(0,11),(0,12),(0,13),(0,14),(0,15),(0,16),(0,17),(0,18);
/*!40000 ALTER TABLE `client` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `courier_delivery`
--

LOCK TABLES `courier_delivery` WRITE;
/*!40000 ALTER TABLE `courier_delivery` DISABLE KEYS */;
/*!40000 ALTER TABLE `courier_delivery` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `delivery`
--

LOCK TABLES `delivery` WRITE;
/*!40000 ALTER TABLE `delivery` DISABLE KEYS */;
/*!40000 ALTER TABLE `delivery` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `delivery_info`
--

LOCK TABLES `delivery_info` WRITE;
/*!40000 ALTER TABLE `delivery_info` DISABLE KEYS */;
/*!40000 ALTER TABLE `delivery_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `delivery_item`
--

LOCK TABLES `delivery_item` WRITE;
/*!40000 ALTER TABLE `delivery_item` DISABLE KEYS */;
/*!40000 ALTER TABLE `delivery_item` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `delivery_method`
--

LOCK TABLES `delivery_method` WRITE;
/*!40000 ALTER TABLE `delivery_method` DISABLE KEYS */;
/*!40000 ALTER TABLE `delivery_method` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `delivery_request`
--

LOCK TABLES `delivery_request` WRITE;
/*!40000 ALTER TABLE `delivery_request` DISABLE KEYS */;
/*!40000 ALTER TABLE `delivery_request` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `delivery_request_status`
--

LOCK TABLES `delivery_request_status` WRITE;
/*!40000 ALTER TABLE `delivery_request_status` DISABLE KEYS */;
/*!40000 ALTER TABLE `delivery_request_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `delivery_status`
--

LOCK TABLES `delivery_status` WRITE;
/*!40000 ALTER TABLE `delivery_status` DISABLE KEYS */;
/*!40000 ALTER TABLE `delivery_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `edit_review_permission`
--

LOCK TABLES `edit_review_permission` WRITE;
/*!40000 ALTER TABLE `edit_review_permission` DISABLE KEYS */;
INSERT INTO `edit_review_permission` VALUES (1,129),(1,130),(0,131),(1,132),(1,133),(1,134),(1,135),(1,136),(1,137),(1,138),(1,139),(1,140),(1,141),(1,142),(1,143),(1,144),(1,145),(1,146),(1,147),(1,148);
/*!40000 ALTER TABLE `edit_review_permission` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `file`
--

LOCK TABLES `file` WRITE;
/*!40000 ALTER TABLE `file` DISABLE KEYS */;
INSERT INTO `file` VALUES (0,'image_not_found.png','png','book-directory/image_not_found.png'),(1,'1_1.jpg','jpg','book-directory/1_1.jpg'),(2,'2_1.jpg','jpg','book-directory/2_1.jpg'),(3,'3_1.jpg','jpg','book-directory/3_1.jpg'),(4,'3_2.jpg','jpg','book-directory/3_2.jpg'),(5,'4_1.jpg','jpg','book-directory/4_1.jpg'),(6,'5_1.jpg','jpg','book-directory/5_1.jpg'),(7,'6_1.jpg','jpg','book-directory/6_1.jpg'),(8,'7_1.jpg','jpg','book-directory/7_1.jpg'),(9,'8_1.jpg','jpg','book-directory/8_1.jpg'),(10,'9_1.jpg','jpg','book-directory/9_1.jpg'),(11,'10_1.jpg','jpg','book-directory/10_1.jpg'),(12,'11_1.jpg','jpg','book-directory/11_1.jpg'),(13,'12_1.jpg','jpg','book-directory/12_1.jpg'),(14,'13_1.jpg','jpg','book-directory/13_1.jpg'),(15,'14_1.jpg','jpg','book-directory/14_1.jpg'),(16,'15_1.jpg','jpg','book-directory/15_1.jpg'),(17,'16_1.jpg','jpg','book-directory/16_1.jpg'),(18,'17_1.jpg','jpg','book-directory/17_1.jpg'),(19,'18_1.jpg','jpg','book-directory/18_1.jpg'),(20,'19_1.jpg','jpg','book-directory/19_1.jpg'),(21,'20_1.jpg','jpg','book-directory/20_1.jpg'),(22,'20_2.jpg','jpg','book-directory/20_2.jpg'),(23,'20_3.jpg','jpg','book-directory/20_3.jpg'),(24,'21_1.jpg','jpg','book-directory/21_1.jpg'),(25,'22_1.jpg','jpg','book-directory/22_1.jpg'),(26,'23_1.jpg','jpg','book-directory/23_1.jpg'),(27,'23_2.jpg','jpg','book-directory/23_2.jpg'),(28,'24_1.jpg','jpg','book-directory/24_1.jpg'),(29,'25_1.jpg','jpg','book-directory/25_1.jpg'),(30,'26_1.jpg','jpg','book-directory/26_1.jpg'),(31,'27_1.jpg','jpg','book-directory/27_1.jpg'),(32,'28_1.jpg','jpg','book-directory/28_1.jpg');
/*!40000 ALTER TABLE `file` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `genre`
--

LOCK TABLES `genre` WRITE;
/*!40000 ALTER TABLE `genre` DISABLE KEYS */;
INSERT INTO `genre` VALUES (4,'Історичний роман'),(8,'Дитяча проза'),(11,'Казки для дітей'),(5,'Класична поезія'),(9,'Класична проза'),(1,'Класична українська література'),(6,'Книги для дітей українською мовою'),(12,'Книги з кулінарії'),(10,'Науково популярна література'),(2,'Проза'),(7,'Романи для підлітків'),(3,'Сучасна проза');
/*!40000 ALTER TABLE `genre` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `nova_poshta_delivery`
--

LOCK TABLES `nova_poshta_delivery` WRITE;
/*!40000 ALTER TABLE `nova_poshta_delivery` DISABLE KEYS */;
/*!40000 ALTER TABLE `nova_poshta_delivery` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `nova_poshta_delivery_status`
--

LOCK TABLES `nova_poshta_delivery_status` WRITE;
/*!40000 ALTER TABLE `nova_poshta_delivery_status` DISABLE KEYS */;
/*!40000 ALTER TABLE `nova_poshta_delivery_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `order`
--

LOCK TABLES `order` WRITE;
/*!40000 ALTER TABLE `order` DISABLE KEYS */;
/*!40000 ALTER TABLE `order` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `order_item`
--

LOCK TABLES `order_item` WRITE;
/*!40000 ALTER TABLE `order_item` DISABLE KEYS */;
/*!40000 ALTER TABLE `order_item` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `order_status`
--

LOCK TABLES `order_status` WRITE;
/*!40000 ALTER TABLE `order_status` DISABLE KEYS */;
/*!40000 ALTER TABLE `order_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `payment_info`
--

LOCK TABLES `payment_info` WRITE;
/*!40000 ALTER TABLE `payment_info` DISABLE KEYS */;
/*!40000 ALTER TABLE `payment_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `payment_method`
--

LOCK TABLES `payment_method` WRITE;
/*!40000 ALTER TABLE `payment_method` DISABLE KEYS */;
/*!40000 ALTER TABLE `payment_method` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `payment_status`
--

LOCK TABLES `payment_status` WRITE;
/*!40000 ALTER TABLE `payment_status` DISABLE KEYS */;
/*!40000 ALTER TABLE `payment_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `publisher`
--

LOCK TABLES `publisher` WRITE;
/*!40000 ALTER TABLE `publisher` DISABLE KEYS */;
INSERT INTO `publisher` VALUES (5,'BookChef'),(8,'Vivat, Pelican'),(3,'Апріорі'),(9,'Видавництво Старого Лева'),(6,'Віхола'),(10,'Діалектика'),(7,'Знання'),(4,'Клуб Сімейного Дозвілля'),(2,'Навчальна книга Богдан'),(1,'Фоліо');
/*!40000 ALTER TABLE `publisher` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `receiver_contact`
--

LOCK TABLES `receiver_contact` WRITE;
/*!40000 ALTER TABLE `receiver_contact` DISABLE KEYS */;
/*!40000 ALTER TABLE `receiver_contact` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `returned_funds`
--

LOCK TABLES `returned_funds` WRITE;
/*!40000 ALTER TABLE `returned_funds` DISABLE KEYS */;
/*!40000 ALTER TABLE `returned_funds` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `returned_funds_method`
--

LOCK TABLES `returned_funds_method` WRITE;
/*!40000 ALTER TABLE `returned_funds_method` DISABLE KEYS */;
/*!40000 ALTER TABLE `returned_funds_method` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `returned_funds_status`
--

LOCK TABLES `returned_funds_status` WRITE;
/*!40000 ALTER TABLE `returned_funds_status` DISABLE KEYS */;
/*!40000 ALTER TABLE `returned_funds_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `role`
--

LOCK TABLES `role` WRITE;
/*!40000 ALTER TABLE `role` DISABLE KEYS */;
INSERT INTO `role` VALUES (1,'MANAGER'),(2,'ADMIN'),(3,'COURIER'),(4,'EDITOR'),(5,'CLIENT');
/*!40000 ALTER TABLE `role` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `shop_delivery`
--

LOCK TABLES `shop_delivery` WRITE;
/*!40000 ALTER TABLE `shop_delivery` DISABLE KEYS */;
/*!40000 ALTER TABLE `shop_delivery` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `shop_delivery_status`
--

LOCK TABLES `shop_delivery_status` WRITE;
/*!40000 ALTER TABLE `shop_delivery_status` DISABLE KEYS */;
/*!40000 ALTER TABLE `shop_delivery_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES ('manager@gmail.com','{noop}manager','Анастасія','Старухіна','Олександрівна','+380 (50) 710-41-06',1,1,0,0,'2023-06-05 17:58:05'),('admin@gmail.com','{noop}admin','Станіслав','Глова','Олександрович','+380 (97) 125-56-23',2,2,0,0,'2023-06-05 18:00:29'),('editor@gmail.com','{noop}editor','Анна','Харченко','Ігорівна','+380 (96) 432-43-21',3,4,0,0,'2023-06-05 18:04:18'),('client@gmail.com','{noop}client','Дмитро','Тюрін','Андрійович','+380 (67) 389-22-02',4,5,0,0,'2023-06-05 18:06:15'),('client2@gmail.com','{noop}client2','Світлана','Старухіна','Миколаївна','+380 (99) 097-22-53',5,5,1,0,'2023-06-05 18:17:37'),('client3@gmail.com','{noop}client3','Софія','Закутська','Валеріївна','+380 (50) 534-28-14',6,5,1,1,'2023-06-05 18:21:13'),('manager2@gmail.com','{noop}manager2','Христина','Соловій','Іванівна','+380 (67) 235-67-32',7,1,0,0,'2023-06-05 18:21:13'),('courier@gmail.com','{noop}courier','Віктор','Ременс','Борисович','+380 (99) 234-75-24',8,3,0,0,'2023-06-06 09:25:52'),('client1a@gmail.com','{noop}client1a','Микита','Задорожний','Михайлович','+380 (67) 464-40-77',9,5,0,0,'2023-06-08 16:29:14'),('client1a2@gmail.com','{noop}client1a2','Даша','Печидівка','Андріївна','+380 (50) 193-64-16',10,5,0,0,'2023-06-02 16:29:17'),('client1a3@gmail.com','{noop}client1a3','Наталія','Зірвигруша','Іванівна','+380 (97) 573-80-08',11,5,0,0,'2023-08-01 16:29:26'),('client1a4@gmail.com','{noop}client1a4','Офелія','Ріпина','Семенівна','+380 (68) 364-15-03',12,5,0,0,'2021-11-24 18:29:32'),('client1a5@gmail.com','{noop}client1a5','Олександр','Товчикаша','Дмитрович','+380 (99) 964-82-11',13,5,0,0,'2022-06-03 16:29:39'),('client1a6@gmail.com','{noop}client1a6','Віталій','Вербицький','Модестович','+380 (66) 434-01-74',14,5,0,0,'2022-06-08 16:29:44'),('client1a7@gmail.com','{noop}client1a7','Офанасій','Оприсько','Сергійович','+380 (96) 102-77-53',15,5,0,0,'2021-06-03 16:29:46'),('client1a8@gmail.com','{noop}client1a8','Євген','Стесенко','Олександрович','+380 (50) 660-77-47',16,5,0,0,'2021-09-11 16:29:47'),('client1a9@gmail.com','{noop}client1a9','Констянтин','Тилич','Вікторович','+380 (97) 259-98-45',17,5,0,0,'2021-01-13 17:29:55'),('client1a10@gmail.com','{noop}client1a10','Софія','Гончаренко','Семенівна','+380 (66) 454-78-15',18,5,0,0,'2023-01-12 17:30:57'),('editor1a@gmail.com','{noop}editor1a','Роза','Войкова','Денисівна','+380 (50) 367-74-99',19,4,0,0,'2021-11-12 17:30:00'),('editor1a2@gmail.com','{noop}editor1a2','Аманда','Прядун','Романівна','+380 (67) 404-11-21',20,4,0,0,'2023-04-05 16:30:06'),('editor1a3@gmail.com','{noop}editor1a3','Павло','Ховавко','Борисович','+380 (68) 845-34-64',21,4,0,0,'2023-02-08 17:30:11');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-06-09  4:45:29
